{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_22": {"name": "keras_tensor_22:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_7_1/normalization_5_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_15_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_15_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_16_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_22", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "12"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/normalization_5_1/Sub", "op": "Sub", "input": ["keras_tensor_22", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/normalization_5_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7_1/normalization_5_1/Sub", "ConstantFolding/StatefulPartitionedCall/sequential_7_1/normalization_5_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_15_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7_1/normalization_5_1/truediv", "StatefulPartitionedCall/sequential_7_1/dense_15_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_7_1/dense_15_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_16_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7_1/dense_15_1/Relu", "StatefulPartitionedCall/sequential_7_1/dense_16_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_7_1/dense_16_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_16_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7_1/dense_16_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7_1/dense_16_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [1, 12], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_7_1/normalization_5_1/truediv_recip", "shape": [1, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_15_1/Cast/ReadVariableOp", "shape": [12, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_15_1/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_16_1/Cast/ReadVariableOp", "shape": [8, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7_1/dense_16_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}